{"title": "Tariffs_and_BEV_writedowns_pull_Fords_earnings_down_for_Q4_2025.pdf", "source_type": "Other", "publish_date": null, "publish_date_confidence": "Low", "original_url": null, "actor_type": "regulator", "government_entities": ["Eu", "Regulator"], "companies_mentioned": ["Ford", "Gm", "Volkswagen", "Vw", "Renault", "Geely", "Byd"], "mentions_our_company": false, "topics": ["OEM Strategy & Powertrain Shifts", "Closure Technology & Innovation", "OEM Programs & Vehicle Platforms"], "keywords": ["tariffs", "writedowns", "pull", "fords", "earnings", "down", "head", "global", "mobility", "perspective"], "country_mentions": ["France", "United States"], "regions_mentioned": ["Europe (including Russia)", "US"], "regions_relevant_to_kiekert": ["Europe (including Russia)", "US"], "region_signal_type": "mixed", "supply_flow_hint": "", "priority": "Medium", "confidence": "Medium", "evidence_bullets": ["S&P Global Mobility perspective Implications Ford’s fourth-quarter results were affected by warranty costs, continued costs from a supplier fire interrupting aluminum supply and tariffs, and part of a US$19.9 billion write-down announced in January 2026. Outlook Ford’s fourth0quarter- results reflected the strains of external issues and the challenges the industry is facing broadly, as well as supplier issues. Wholesales declined, pulling revenue down. Fires at aluminum supplier Novelis impacted F-Series production and Ford announced a major write-down from changes to BEV plans and capacity investments. The result is the worst quarter for Ford since the recession, although the full year delivered record revenue and there were positive signals over the year. Ford is confident the changes it is making will lead to meeting future targets and a profitable future, although CEO Jim Farley also noted that the regulatory environment in markets across the globe remain a significant risk. In 2025, the US tariff effect hit Ford for about US$2.0 billion, which was closer to what the automaker had provided as guidance with second-quarter 2025 earnings and US$1 billion higher than the company indicated it expected in October 2025. In October 2025, the US extended the offset for imported goods based on MSRP of US production and expanded the list of goods included in that offset. Ford then reduced its expectations for tariff impact in 2025 to about US$1.0 billion. However, while Ford had expected the offset would apply to production back to May 3, 2025, when the Section 232 tariffs on auto parts and autos were implemented, Ford later learned that the offset calculation started as of Nov. 1, 2025. Ford has also targeted a cost reduction of US$1.0 billion in 2025; in October 2025 Ford said it was on track to meet that, but with full-year reporting, the company said it has achieved USD$1.5 billion in cost reductions. Ford’s 2025 results were also impacted by two fires at aluminum supplier Novelis in September and November. The first fire idled the Novelis hot mill and the second delayed getting it back online; Ford now says the hot mill will be restored sometime between May and September 2026. The impact in 2025 reached US$2.0 billion. Although the US$2.0 billion is nonrecurring, in 2026, Ford expects US$1.5-2.0 billion in temporary costs through the first and second quarters of 2026, until the Novelis hot mill is back. These costs are related to freight, tariffs and higher prices for alternate aluminum sourcing to ensure supply continuity. Ford CFO Sherry House said that Ford initially expected it could make up about US$1 billion of the 2025 impact with efforts to increase production and make up some lost volume, but the second fire changed expectations. House says now Ford thinks it will make up between US$0.5-1 billion. Ford also confirmed it lost around 100,000 units of production due to this issue in 2025; production increases announced in 2025 will help make up between 50,000 and 60,000 units in 2026. Ford's global financial performance Q4 2025 Q4 2024 YOY % change YTD 2025 YTD 2024 YOY % change Wholesales (thousands) 1,083 1,188 -8.8 4,395 4,470 -1.7 Revenue (US$ bil.) 45.9 48.2 -4.8 187.3 185.0 1.2 Adjusted pre-tax results (US$ mil.) -14,810 1,831 -908.8 -8,162 5,894 -238.5 Net income (loss), attributable to Ford (US$ mil.) (GAAP) -11,064 1,824 -706.6 -8,182 5,879 -239.2 Net income margin (GAAP) -24.1 3.8 (20.3) pts -4.4 3.2 (1.2)pts Adjusted EBIT (US$ mil) (non-GAAP) 1,035 2,138 -51.6 6,780 10,208 -33.6 Adjusted EBIT margin (non-GAAP) 2.3 4.4 (2.1)pts 3.6 5.5 (1.9)pts Debt (US$ bil.), vs Dec 31, 2024 -21.0 -19.9 5.5 Net cash (US$ bil.) vs Dec 31, 2024 7.7 8.7 -11.5 No portion of this report may be reproduced, reused, or otherwise distributed in any form without prior written consent, with the exception of any internal client distribution as may be permitted in the license agreement between client and S&P Global. Content reproduced or redistributed with S&P Global permission must display S&P Global legal notices and attributions of authorship. The information contained herein is from sources considered reliable but its accuracy and completeness are not warranted, nor are the opinions and analyses which are based upon it, and to the extent permitted by law, S&P Global shall not be liable for any errors or omissions or any loss,damage or expense incurred by reliance on information or any statement contained herein. © S&P Global. 2026 Tariffs and BEV write-downs pull Ford’s earnings down for Q4 2025 11 Feb 2026 - AutoIntelligence | Headline Analysis Ford's global financial performance Q4 2025 Q4 2024 YOY % change YTD 2025 YTD 2024 YOY % change Adjusted ROIC (%, trailing four quarters) 8.8 12.9 (4.1)pts Source: Ford Motor Company However, more impactful than tariffs or the Novelis fire on fourth-quarter and full-year results was a US$19.5 billion write-down related to changed battery electric vehicle (BEV) plans announced in December 2025. The bulk of that amount, US$14 billion, was applied to the fourth quarter of 2025. The remainder will be applied to results in 2026 and 2027 (see United States: Dec. 16, 2025: Ford revamps US EV plans, announces range-extended F-150). In the fourth quarter of 2025, Ford noted a US$10.7 billion impairment on BEV cancellations and a US$3.2 billion impact for getting out of the Blue Oval SK battery plant. The US$14 billion put the fourth quarter into a significant loss and ensured full-year results were also in negative territory. Ford has not abandoned BEV but has completely shifted strategy to focus on a more affordable solution. During the call, Farley said, “We're launching a cost-efficient universal EV platform that will drive profitable growth in the lower-price segments where the EVs have continued to thrive in America. We will launch multiple vehicles off that same platform.” Farley also expects that this approach will enable a scalable platform that can also help support Ford if the US regulatory environment sees another drastic change. Ford announced the new universal EV platform in August 2025 (see United States: Aug. 12, 2025: Ford", "Adjusted ROIC (%, trailing four quarters)"], "key_insights": ["The strongest detected signal aligns with 'OEM Strategy & Powertrain Shifts'.", "The article likely affects near-term planning assumptions for automotive suppliers."], "strategic_implications": ["Monitor platform/program timing for knock-on effects to closure component demand.", "Validate sourcing and regional capacity assumptions against these signals."], "recommended_actions": ["Tag this item for analyst review and confirmation of entities/dates.", "Cross-check this signal against current OEM program trackers."], "review_status": "Not Reviewed", "notes": "Local deterministic extraction (no external model call configured).", "_provider_used": "gemini", "record_id": "cb38b72c34b9", "created_at": "2026-02-11T21:08:54+00:00", "source_pdf_path": "C:\\Users\\sandr\\OneDrive\\11_MSIS\\549B - AI Machine Learning\\COGNITRA\\data\\pdfs\\cb38b72c34b9__Tariffs_and_BEV_writedowns_pull_Fords_earnings_down_for_Q4_2025.pdf", "_router_log": {"provider_choice": "auto", "providers_tried": [{"provider": "gemini", "attempted_at": "2026-02-11T21:08:54+00:00", "repair_used": false, "errors": []}], "fallback_used": false}}
{"title": "Ford_Geely_in_talks_over_European_production__report.pdf", "source_type": "Reuters", "publish_date": null, "publish_date_confidence": "Low", "original_url": null, "actor_type": "regulator", "government_entities": ["Epa", "Eu", "European Commission", "Government"], "companies_mentioned": ["Tesla", "Ford", "Geely", "Byd"], "mentions_our_company": false, "topics": ["OEM Strategy & Powertrain Shifts", "Closure Technology & Innovation", "OEM Programs & Vehicle Platforms"], "keywords": ["ford", "geely", "talks", "over", "european", "production", "report", "head", "global", "mobility"], "country_mentions": ["China", "Germany", "Spain", "United States"], "regions_mentioned": ["China", "Europe (including Russia)", "US"], "regions_relevant_to_kiekert": ["China", "Europe (including Russia)", "US"], "region_signal_type": "mixed", "supply_flow_hint": "", "priority": "Medium", "confidence": "Medium", "evidence_bullets": ["S&P Global Mobility perspective Implications Ford and Geely are reported to be in talks over using Ford’s excess capacity in Europe to manufacture Geely Group models. Outlook According to the report, the talks are centered on using Ford’s spare capacity, most likely in Valencia, to produce models inside the EU and thus circumvent the trade bloc’s tariff regime. The story comes after Ford was reported to be exploring a manufacturing alliance with Xiaomi in the US, which Ford has denied. Ford and Geely are in what has been described as ‘advanced discussions’ over how Geely could utilize Ford’s excess production capacity in Europe to build vehicles for the EU market, according to a Reuters report. The report, which was supported by three unnamed sources, said talks are focused on Ford’s facility in Valencia, Spain, and would allow Geely to produce vehicles there. This would give Geely tariff- free access to the EU member markets after the EU imposed import tariffs on Chinese BEV imports in 2024. Ford and Geely are also said to be looking at possible cooperation over actual vehicle technologies, including autonomous vehicle research and development (R&D) programs. However, at the moment the main focus is on the manufacturing alliance and discussions on this topic are much further advanced than the vehicle technology discussions. Ford reportedly sent a delegation to China to advance negotiations, following meetings in Michigan between senior Geely executives and Ford leadership. This report comes after a separate report that Ford had been in discussions with Geely’s Chinese competitor Xiaomi, about the possibility of forming a manufacturing alliance using Ford’s excess production capacity in the US. A Financial Times (FT) report cited four unnamed sources that Ford is exploring a joint venture (JV) that would enable manufacturing of battery electric vehicles (BEVs) in the US. The FT also said that Ford has been talking with other mainland Chinese automakers, including BYD. Any move to form a JV with Xiaomi in the US would obviously have potentially seismic political ramifications for the brand. Therefore, it was not particularly surprising that a Ford spokesperson was quoted in the FT as saying, “This story is completely false. There is no truth to it.” A statement from Xiaomi was also quoted as saying, “Reports that Xiaomi is discussing a joint venture with Ford Motor Co. are false. Xiaomi does not sell its products and services in the United States and is not negotiating to do so.” BYD reportedly declined to comment. Ford took an understandably different stance, stating that it would not comment on specific discussions, but adding that it routinely talks with other companies about potential partnerships. Geely declined to offer any comment on whether the talks had taken place. Outlook and implications The EU imposed tariffs on Chinese-built BEVs on Oct. 30, 2024, after carrying out an extensive 13-month investigation into Chinese government support for the Chinese carmakers importing into Europe, which it classed as anti-competitive subsidies. At the time the EU concluded that the Chinese BEV value chain \"benefits from unfair subsidization which is causing threat of economic injury to EU producers of BEVs.\" Chinese OEMs were given different tariffs depending on their level of cooperation with the investigation and the level of subsidy received, ranging from a tariff of 7.8% imposed on Tesla’s Chinese imports up to the level of 35.3% for companies that did not cooperate with the EU investigation. This was in addition to an existing 10% import tariff. Geely’s came in at 18.8%. The EU and China are negotiating alternatives to tariffs. One solution is a \"price undertaking,\" otherwise known as ‘minimum pricing’ which would set a minimum price for imports. The European Commission published a Minimum Import Price (MIP) regime model by model in January this year, with the MIP being based upon an exporter’s historical prices plus the duty margin, or on the price of a comparable EU- No portion of this report may be reproduced, reused, or otherwise distributed in any form without prior written consent, with the exception of any internal client distribution as may be permitted in the license agreement between client and S&P Global. Content reproduced or redistributed with S&P Global permission must display S&P Global legal notices and attributions of authorship. The information contained herein is from sources considered reliable but its accuracy and completeness are not warranted, nor are the opinions and analyses which are based upon it, and to the extent permitted by law, S&P Global shall not be liable for any errors or omissions or any loss,damage or expense incurred by reliance on information or any statement contained herein. © S&P Global. 2026 Ford, Geely in talks over European production – report 4 Feb 2026 - AutoIntelligence | Headline Analysis produced BEV. The guidance said, “Any commitment to invest in the BEV-related industries within the EU will be considered and assessed.” The MIP guidance would appear to give Chinese importers a mechanism to sell vehicles in the EU without being subject to tariffs, but of course limits their scope to price vehicles aggressively win share and drive volume. This, and the reported cooperation on vehicle technology, would indicate the rationale behind any potential cooperation between Geely and Ford; Geely would like access to the EU while retaining full flexibility in its pricing. At the time of writing, Ford only builds the Kuga at Valencia and there is certainly currently capacity at the plant, although it plans to add a sport utility vehicle (SUV) using the Bronco nameplate from 2027. It is also possible that Ford’s remaining plant in Germany could be part of the discussion, with the Cologne facility currently manufacturing the slow selling Explorer and Capri BEVs, but Spain’s lower labor costs are likely to be more attractive to Geely. Analyst Contact Details: Tim Urquhart © S&P Global. 2026 Page 2 of 2", "Ford and Geely are reported to be in talks over using Ford’s excess capacity in Europe to manufacture Geely Group models."], "key_insights": ["The strongest detected signal aligns with 'OEM Strategy & Powertrain Shifts'.", "The article likely affects near-term planning assumptions for automotive suppliers."], "strategic_implications": ["Monitor platform/program timing for knock-on effects to closure component demand.", "Validate sourcing and regional capacity assumptions against these signals."], "recommended_actions": ["Tag this item for analyst review and confirmation of entities/dates.", "Cross-check this signal against current OEM program trackers."], "review_status": "Not Reviewed", "notes": "Local deterministic extraction (no external model call configured).", "_provider_used": "gemini", "record_id": "47e845de2154", "created_at": "2026-02-12T02:00:18+00:00", "source_pdf_path": "C:\\Users\\sandr\\OneDrive\\11_MSIS\\549B - AI Machine Learning\\COGNITRA\\data\\pdfs\\47e845de2154__Ford_Geely_in_talks_over_European_production__report.pdf", "_router_log": {"provider_choice": "auto", "providers_tried": [{"provider": "gemini", "attempted_at": "2026-02-12T02:00:18+00:00", "repair_used": false, "errors": []}], "fallback_used": false}}
{"title": "Ford Geely in talks over European production report", "source_type": "S&P", "publish_date": "2026-02-04", "publish_date_confidence": "High", "original_url": null, "actor_type": "oem", "government_entities": ["European Union", "European Commission", "China"], "companies_mentioned": ["Ford", "Geely", "Xiaomi", "BYD", "Tesla"], "mentions_our_company": false, "topics": ["OEM Strategy & Powertrain Shifts", "Supply Chain & Manufacturing", "Regulatory & Safety"], "keywords": ["Ford", "Geely", "Europe", "manufacturing alliance", "excess capacity", "tariffs", "BEV", "Valencia", "Spain", "EU", "Xiaomi", "BYD"], "country_mentions": ["Spain", "China", "United States", "Germany"], "regions_mentioned": ["Europe (including Russia)", "Michigan", "European Union", "China", "US"], "regions_relevant_to_kiekert": ["Europe (including Russia)", "China", "US"], "region_signal_type": "Production/Sales relocation due to regulatory pressure", "supply_flow_hint": "Chinese OEMs seeking local production in Europe to bypass tariffs, potentially utilizing existing OEM capacity.", "priority": "High", "confidence": "High", "evidence_bullets": ["Ford and Geely are in what has been described as ‘advanced discussions’ over how Geely could utilize Ford’s excess production capacity in Europe to build vehicles for the EU market, according to a Reuters report.", "The report, which was supported by three unnamed sources, said talks are focused on Ford’s facility in Valencia, Spain, and would allow Geely to produce vehicles there.", "This would give Geely tariff-free access to the EU member markets after the EU imposed import tariffs on Chinese BEV imports in 2024.", "At the time of writing, Ford only builds the Kuga at Valencia and there is certainly currently capacity at the plant, although it plans to add a sport utility vehicle (SUV) using the Bronco nameplate from 2027."], "key_insights": ["Ford and Geely are in advanced talks for Geely to use Ford's excess manufacturing capacity in Europe, specifically at the Valencia plant in Spain.", "The primary motivation for Geely is to circumvent the EU's recently imposed import tariffs on Chinese-built Battery Electric Vehicles (BEVs).", "Ford is exploring ways to utilize its underutilized European facilities, potentially leveraging its spare capacity.", "The discussions may also include cooperation on vehicle technologies like autonomous R&D, though manufacturing alliance is the current focus."], "strategic_implications": ["Increased local production of Chinese BEVs in Europe could intensify competition for Kiekert, particularly from OEMs like Geely gaining tariff-free access.", "Potential for new OEM programs and platforms in Europe if these manufacturing alliances or JVs materialize, requiring Kiekert to proactively engage with these emerging production hubs.", "OEMs like Ford are seeking innovative ways to manage excess capacity and adapt to geopolitical trade policies, indicating a shift in global manufacturing strategies that Kiekert should monitor.", "Kiekert should assess the implications for its European operations and customer relationships, especially with Ford and any new entrants or partners."], "recommended_actions": ["Monitor the progress of Ford-Geely talks closely, especially regarding plant locations and new vehicle platforms.", "Assess the potential impact of increased localized Chinese OEM production in Europe on Kiekert's market share and competitive landscape.", "Proactively engage with Ford's European operations to understand future capacity utilization plans and potential new programs.", "Explore engagement strategies with Geely, and other Chinese OEMs considering European production, to identify potential business opportunities."], "review_status": "Not Reviewed", "notes": "This report also mentions Ford denying talks with Xiaomi for a US manufacturing alliance, and discussions with BYD, indicating a broader trend of Western OEMs exploring partnerships with Chinese automakers due to overcapacity and EV transition.", "record_id": "5b60f23822eb", "created_at": "2026-02-12T04:20:57+00:00", "source_pdf_path": "C:\\Users\\sandr\\OneDrive\\11_MSIS\\549B - AI Machine Learning\\COGNITRA\\data\\pdfs\\5b60f23822eb__Ford_Geely_in_talks_over_European_production__report.pdf", "_router_log": {"provider_choice": "auto", "providers_tried": [{"provider": "gemini", "attempted_at": "2026-02-12T04:20:40+00:00", "repair_used": false, "errors": []}], "fallback_used": false}}
{"title": "Ford_Geely_in_talks_over_European_production__report.pdf", "source_type": "S&P", "publish_date": "2026-02-04", "publish_date_confidence": "High", "original_url": "https://www.spglobal.com/mobility/research/ford-geely-talks-european-production-report-20260204.pdf", "actor_type": "oem", "government_entities": ["EU"], "companies_mentioned": ["Ford", "Geely", "Xiaomi", "BYD", "Tesla"], "mentions_our_company": false, "topics": ["OEM Strategy & Powertrain Shifts", "Supply Chain & Manufacturing", "Market & Competition"], "keywords": ["Ford", "Geely", "Europe", "manufacturing alliance", "excess capacity", "tariffs", "BEV", "Spain", "Valencia", "automotive", "China", "production"], "country_mentions": ["Spain", "US", "China", "Germany"], "regions_mentioned": ["Europe (including Russia)", "China", "US"], "regions_relevant_to_kiekert": ["Europe (including Russia)", "China"], "region_signal_type": "in-region production", "supply_flow_hint": "Demand-side market access", "priority": "High", "confidence": "High", "evidence_bullets": ["Ford and Geely are in advanced talks to use Ford's excess capacity in Europe for Geely Group models.", "Discussions focus on Ford's Valencia plant in Spain to help Geely circumvent EU BEV import tariffs.", "The EU imposed tariffs on Chinese-built BEVs in October 2024, with Geely facing an 18.8% tariff.", "Cooperation on vehicle technologies and R&D programs is also being explored by Ford and Geely."], "key_insights": ["EU tariffs on Chinese BEVs are driving strategic manufacturing alliances and localized production.", "Ford is exploring utilizing its global excess production capacity with various Chinese automakers.", "Geely aims to gain tariff-free access to the EU market by manufacturing vehicles within Europe.", "Beyond manufacturing, Ford and Geely may also collaborate on vehicle technology and R&D."], "strategic_implications": ["Tariffs are reshaping global automotive supply chains, favoring in-region production for market access.", "OEMs with excess capacity, like Ford, can leverage it through partnerships to optimize assets.", "Chinese OEMs like Geely are proactively adapting to trade barriers by establishing EU manufacturing.", "Potential for new technology partnerships between traditional OEMs and emerging players due to market pressures."], "recommended_actions": ["Monitor developments in Ford-Geely manufacturing alliance, especially plant locations.", "Assess the impact of EU tariffs on Chinese OEMs' production strategies and investment plans.", "Evaluate potential for similar partnerships between other OEMs to address excess capacity or market access.", "Analyze the implications of Geely's potential EU production on market competition.", "Track any emerging technology cooperation between Ford and Geely."], "review_status": "Not Reviewed", "notes": "Content extracted from S&P Global report.", "record_id": "d4ca10ae2ec1", "created_at": "2026-02-12T04:48:41+00:00", "source_pdf_path": "C:\\Users\\sandr\\OneDrive\\11_MSIS\\549B - AI Machine Learning\\COGNITRA\\data\\pdfs\\d4ca10ae2ec1__Ford_Geely_in_talks_over_European_production__report.pdf", "_router_log": {"provider_choice": "auto", "providers_tried": [{"provider": "gemini", "attempted_at": "2026-02-12T04:48:26+00:00", "repair_used": false, "errors": []}], "fallback_used": false}}
